# St7SetSRABaseCaseName

Sets the name of the specified Spectral Response analysis Base Excitation case.

long St7SetSRABaseCaseName(long uID, long SRACase, char* CaseName)

Input Parameters

uID

Strand7 model file ID.

SRACase

Spectral Response base excitation case number.

CaseName

String containing the new name of the base excitation case.